# Data Visualization with Python, Exercise 4.9 Part 1

## Table of contents

### 1. Library and Data import
### 2. Customer Data Wrangling
### 3. Importing ords_prods df
### 4. Merging customers and ords_prods dataframes

In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Defining path
path = r'C:\Users\chris\OneDrive\Desktop\Data Analytics CF\202203_Instacart Basket Analysis'

In [3]:
# Importing customer data
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

### 2. Customer Data Wrangling

In [4]:
customers.shape

(206209, 10)

In [5]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
customers.tail()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

In [7]:
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [8]:
# renaming columns to small letters and no spaces
customers = customers.rename(columns = {'First Name': 'first_name', 'Surnam':'last_name', 'Gender': 'gender', 'STATE':'state', 'Age':'age'})

In [9]:
# Identifying mixed-typed columns
for col in customers.columns.tolist():
  weird = (customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (customers[weird]) > 0:
    print (col)

first_name

In [10]:
# changing first_name to string
customers['first_name'] = customers['first_name'].astype(str)

In [11]:
customers['gender'].value_counts(dropna = False)

Male      104067
Female    102142
Name: gender, dtype: int64

In [12]:
customers['fam_status'].value_counts(dropna = False)

married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: fam_status, dtype: int64

In [13]:
customers['state'].value_counts(dropna = False).sort_index()

Alabama                 4044
Alaska                  4044
Arizona                 4044
Arkansas                4044
California              4044
Colorado                4044
Connecticut             4044
Delaware                4044
District of Columbia    4044
Florida                 4044
Georgia                 4044
Hawaii                  4044
Idaho                   4044
Illinois                4044
Indiana                 4044
Iowa                    4044
Kansas                  4043
Kentucky                4043
Louisiana               4043
Maine                   4043
Maryland                4043
Massachusetts           4043
Michigan                4043
Minnesota               4043
Mississippi             4043
Missouri                4043
Montana                 4043
Nebraska                4043
Nevada                  4043
New Hampshire           4043
New Jersey              4043
New Mexico              4043
New York                4043
North Carolina          4043
North Dakota            4043
Ohio                    4043
Oklahoma                4043
Oregon                  4043
Pennsylvania            4043
Rhode Island            4043
South Carolina          4043
South Dakota            4043
Tennessee               4043
Texas                   4043
Utah                    4043
Vermont                 4043
Virginia                4043
Washington              4043
West Virginia           4043
Wisconsin               4043
Wyoming                 4043
Name: state, dtype: int64

In [14]:
# counting unique number of states to detect possible irregularities
customers['state'].nunique()

51

In [15]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   first_name    206209 non-null  object
 2   last_name     206209 non-null  object
 3   gender        206209 non-null  object
 4   state         206209 non-null  object
 5   age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [16]:
# changing user_id to int32 to match other dataframe key
customers['user_id'] = customers['user_id'].astype('int32')

In [17]:
customers

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374
...,...,...,...,...,...,...,...,...,...,...
206204,168073,Lisa,Case,Female,North Carolina,44,4/1/2020,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,4/1/2020,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,4/1/2020,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,4/1/2020,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,4/1/2020,1,married,57095

In [18]:
# identifying duplicates on all columns
customers.loc[customers.duplicated(keep = False),]

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, n_dependants, fam_status, income]
Index: []

No duplicates found. Dropping of duplicates is not necessary.

In [19]:
# Checking for duplicate user ids
customers['user_id'].duplicated(keep = False).sum()

0

In [20]:
# Checking for possible other duplicates on several columns
customers.duplicated(subset=['first_name', 'last_name', 'gender', 'state', 'age']).sum()

6305

Although several columns do have the same information which might suggest that a user signed up at a certain point in time and later on created a new account (change in marital status, new job), the user id is unique so no rows will be deleted.

In [21]:
customers.shape

(206209, 10)

In [22]:
# dropping date_joined column as it has no additional value for planned analysis, also dropping first_name and last_name because user_id is a unique identifier
customers = customers.drop( columns = ['date_joined', 'first_name', 'last_name'])

In [24]:
# Identifying missing values in columns
customers.isnull().sum()

user_id         0
gender          0
state           0
age             0
n_dependants    0
fam_status      0
income          0
dtype: int64

## 3. Importing ords_prods dataframe

In [28]:
ords_prods = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_merge_grouped.pkl'))

In [29]:
ords_prods.shape

(32404859, 24)

In [32]:
ords_prods.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order_x,product_id,add_to_cart_order,reordered,aisle_id,department_id,prices,max_order,average_price,median_days_since_prior_order
count,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,30328763.0,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,3.240486e+07,32404854.0
mean,1.710745e+06,1.029372e+05,1.714230e+01,2.738867e+00,1.342515e+01,NaN,2.559866e+04,8.352547e+00,5.895873e-01,6.449111e+01,9.919792e+00,9.740085e+00,3.305217e+01,9.452054e+00,NaN
std,9.872988e+05,5.946610e+04,1.753532e+01,2.090077e+00,4.246380e+00,0.0,1.408400e+04,7.127071e+00,4.919087e-01,4.843815e+01,6.281485e+00,4.956429e+02,2.515525e+01,8.324697e+01,0.0
min,2.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.0,1.000000e+00,1.000000e+00,0.000000e+00,-1.280000e+02,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.0
25%,8.559470e+05,5.142200e+04,5.000000e+00,1.000000e+00,1.000000e+01,5.0,1.354400e+04,3.000000e+00,0.000000e+00,2.400000e+01,4.000000e+00,4.200000e+00,1.300000e+01,7.387299e+00,5.5
50%,1.711049e+06,1.026160e+05,1.100000e+01,3.000000e+00,1.300000e+01,8.0,2.530200e+04,6.000000e+00,1.000000e+00,7.900000e+01,9.000000e+00,7.400000e+00,2.600000e+01,7.824786e+00,7.0
75%,2.565499e+06,1.543890e+05,2.400000e+01,5.000000e+00,1.600000e+01,15.0,3.794700e+04,1.100000e+01,1.000000e+00,1.000000e+02,1.600000e+01,1.130000e+01,4.700000e+01,8.254023e+00,13.0
max,3.421083e+06,2.062090e+05,9.900000e+01,6.000000e+00,2.300000e+01,30.0,4.968800e+04,1.450000e+02,1.000000e+00,1.270000e+02,2.100000e+01,9.999900e+04,9.900000e+01,2.500543e+04,30.0

In [31]:
ords_prods.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 24 columns):
 #   Column                         Dtype
---  ------                         -----
 0   order_id                       int32
 1   user_id                        int32
 2   order_number                   int8
 3   orders_day_of_week             int8
 4   order_hour_of_day              int8
 5   days_since_prior_order_x       float16
 6   first_order                    bool
 7   product_id                     int32
 8   add_to_cart_order              int32
 9   reordered                      int8
 10  product_name                   object
 11  aisle_id                       int8
 12  department_id                  int8
 13  prices                         float32
 14  price_range_loc                object
 15  busiest_day                    object
 16  busiest_days                   object
 17  busiest_period_of_day          object
 18  max_order                      int8
 19  loyalty_flag                   object
 20  average_price                  float32
 21  spending_flag                  object
 22  median_days_since_prior_order  float16
 23  Frequency_flag                 object
dtypes: bool(1), float16(2), float32(2), int32(4), int8(7), object(8)
memory usage: 3.3+ GB

## 4.0 Merging Dataframes

In [33]:
ords_prods_cust_merge = ords_prods.merge(customers, on = 'user_id', indicator = True)

In [34]:
ords_prods_cust_merge.shape

(32404859, 31)

In [35]:
ords_prods_cust_merge['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [36]:
ords_prods_cust_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 31 columns):
 #   Column                         Dtype
---  ------                         -----
 0   order_id                       int32
 1   user_id                        int32
 2   order_number                   int8
 3   orders_day_of_week             int8
 4   order_hour_of_day              int8
 5   days_since_prior_order_x       float16
 6   first_order                    bool
 7   product_id                     int32
 8   add_to_cart_order              int32
 9   reordered                      int8
 10  product_name                   object
 11  aisle_id                       int8
 12  department_id                  int8
 13  prices                         float32
 14  price_range_loc                object
 15  busiest_day                    object
 16  busiest_days                   object
 17  busiest_period_of_day          object
 18  max_order                      int8
 19  loyalty_flag                   object
 20  average_price                  float32
 21  spending_flag                  object
 22  median_days_since_prior_order  float16
 23  Frequency_flag                 object
 24  gender                         object
 25  state                          object
 26  age                            int64
 27  n_dependants                   int64
 28  fam_status                     object
 29  income                         int64
 30  _merge                         category
dtypes: bool(1), category(1), float16(2), float32(2), int32(4), int64(3), int8(7), object(11)
memory usage: 4.7+ GB

In [37]:
ords_prods_cust_merge.drop(columns = '_merge', inplace = True)

In [38]:
ords_prods_cust_merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 30 columns):
 #   Column                         Dtype
---  ------                         -----
 0   order_id                       int32
 1   user_id                        int32
 2   order_number                   int8
 3   orders_day_of_week             int8
 4   order_hour_of_day              int8
 5   days_since_prior_order_x       float16
 6   first_order                    bool
 7   product_id                     int32
 8   add_to_cart_order              int32
 9   reordered                      int8
 10  product_name                   object
 11  aisle_id                       int8
 12  department_id                  int8
 13  prices                         float32
 14  price_range_loc                object
 15  busiest_day                    object
 16  busiest_days                   object
 17  busiest_period_of_day          object
 18  max_order                      int8
 19  loyalty_flag                   object
 20  average_price                  float32
 21  spending_flag                  object
 22  median_days_since_prior_order  float16
 23  Frequency_flag                 object
 24  gender                         object
 25  state                          object
 26  age                            int64
 27  n_dependants                   int64
 28  fam_status                     object
 29  income                         int64
dtypes: bool(1), float16(2), float32(2), int32(4), int64(3), int8(7), object(11)
memory usage: 4.7+ GB

In [39]:
ords_prods_cust_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'instacart_merged_data.pkl'))